---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOutOption
source: html/f32b7604-af03-5673-de5c-0cba9bafa416.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartDiameterOutOption Property

"Main Secondary Diameter Option"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartDiameterOutOption { get; }
```